ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/tc.h
#define TC_QIMR_FMP (0x1u << 7) /**< \brief (TC_QIMR) Filtered Missing Pulse */
/* -------- TC_QISR : (TC Offset: 0xD4) QDEC Interrupt Status Register -------- */
#define TC_QISR_IDX (0x1u << 0) /**< \brief (TC_QISR) Index */
#define TC_QISR_DIRCHG (0x1u << 1) /**< \brief (TC_QISR) Direction Change */
#define TC_QISR_QERR (0x1u << 2) /**< \brief (TC_QISR) Quadrature Error */
#define TC_QISR_FPHA (0x1u << 4) /**< \brief (TC_QISR) Filtered Phase A Line */
#define TC_QISR_FPHB (0x1u << 5) /**< \brief (TC_QISR) Filtered Phase B Line */
#define TC_QISR_FIDX (0x1u << 6) /**< \brief (TC_QISR) Filtered Index Line */
#define TC_QISR_FMP (0x1u << 7) /**< \brief (TC_QISR) Filtered Missing Pulse */
#define TC_QISR_DIR (0x1u << 8) /**< \brief (TC_QISR) Direction */
/* -------- TC_FMR : (TC Offset: 0xD8) Fault Mode Register -------- */
#define TC_FMR_ENCF0 (0x1u << 0) /**< \brief (TC_FMR) Enable Compare Fault Channel 0 */
#define TC_FMR_ENCF1 (0x1u << 1) /**< \brief (TC_FMR) Enable Compare Fault Channel 1 */
/* -------- TC_QSR : (TC Offset: 0xDC) QDEC Status Register -------- */
#define TC_QSR_DIR (0x1u << 8) /**< \brief (TC_QSR) Direction */
/* -------- TC_WPMR : (TC Offset: 0xE4) Write Protection Mode Register -------- */
#define TC_WPMR_WPEN (0x1u << 0) /**< \brief (TC_WPMR) Write Protection Enable */
#define TC_WPMR_WPITEN (0x1u << 1) /**< \brief (TC_WPMR) Write Protection Interrupt Enable */
#define TC_WPMR_WPCREN (0x1u << 2) /**< \brief (TC_WPMR) Write Protection Control Enable */
#define TC_WPMR_FIRSTE (0x1u << 4) /**< \brief (TC_WPMR) First Error Report Enable */
#define TC_WPMR_WPKEY_Pos 8
#define TC_WPMR_WPKEY_Msk (0xffffffu << TC_WPMR_WPKEY_Pos) /**< \brief (TC_WPMR) Write Protection Key */
#define TC_WPMR_WPKEY(value) ((TC_WPMR_WPKEY_Msk & ((value) << TC_WPMR_WPKEY_Pos)))
#define   TC_WPMR_WPKEY_PASSWD (0x54494Du << 8) /**< \brief (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. */
/* -------- TC_RPR : (TC Offset: 0x100) Receive Pointer Register -------- */
#define TC_RPR_RXPTR_Pos 0
#define TC_RPR_RXPTR_Msk (0xffffffffu << TC_RPR_RXPTR_Pos) /**< \brief (TC_RPR) Receive Pointer Register */
#define TC_RPR_RXPTR(value) ((TC_RPR_RXPTR_Msk & ((value) << TC_RPR_RXPTR_Pos)))
/* -------- TC_RCR : (TC Offset: 0x104) Receive Counter Register -------- */
#define TC_RCR_RXCTR_Pos 0
#define TC_RCR_RXCTR_Msk (0xffffu << TC_RCR_RXCTR_Pos) /**< \brief (TC_RCR) Receive Counter Register */
#define TC_RCR_RXCTR(value) ((TC_RCR_RXCTR_Msk & ((value) << TC_RCR_RXCTR_Pos)))
/* -------- TC_RNPR : (TC Offset: 0x110) Receive Next Pointer Register -------- */
#define TC_RNPR_RXNPTR_Pos 0
#define TC_RNPR_RXNPTR_Msk (0xffffffffu << TC_RNPR_RXNPTR_Pos) /**< \brief (TC_RNPR) Receive Next Pointer */
#define TC_RNPR_RXNPTR(value) ((TC_RNPR_RXNPTR_Msk & ((value) << TC_RNPR_RXNPTR_Pos)))
/* -------- TC_RNCR : (TC Offset: 0x114) Receive Next Counter Register -------- */
#define TC_RNCR_RXNCTR_Pos 0
#define TC_RNCR_RXNCTR_Msk (0xffffu << TC_RNCR_RXNCTR_Pos) /**< \brief (TC_RNCR) Receive Next Counter */
#define TC_RNCR_RXNCTR(value) ((TC_RNCR_RXNCTR_Msk & ((value) << TC_RNCR_RXNCTR_Pos)))
/* -------- TC_PTCR : (TC Offset: 0x120) Transfer Control Register -------- */
#define TC_PTCR_RXTEN (0x1u << 0) /**< \brief (TC_PTCR) Receiver Transfer Enable */
#define TC_PTCR_RXTDIS (0x1u << 1) /**< \brief (TC_PTCR) Receiver Transfer Disable */
#define TC_PTCR_TXTEN (0x1u << 8) /**< \brief (TC_PTCR) Transmitter Transfer Enable */
#define TC_PTCR_TXTDIS (0x1u << 9) /**< \brief (TC_PTCR) Transmitter Transfer Disable */
#define TC_PTCR_RXCBEN (0x1u << 16) /**< \brief (TC_PTCR) Receiver Circular Buffer Enable */
#define TC_PTCR_RXCBDIS (0x1u << 17) /**< \brief (TC_PTCR) Receiver Circular Buffer Disable */
#define TC_PTCR_TXCBEN (0x1u << 18) /**< \brief (TC_PTCR) Transmitter Circular Buffer Enable */
#define TC_PTCR_TXCBDIS (0x1u << 19) /**< \brief (TC_PTCR) Transmitter Circular Buffer Disable */
#define TC_PTCR_ERRCLR (0x1u << 24) /**< \brief (TC_PTCR) Transfer Bus Error Clear */
/* -------- TC_PTSR : (TC Offset: 0x124) Transfer Status Register -------- */
#define TC_PTSR_RXTEN (0x1u << 0) /**< \brief (TC_PTSR) Receiver Transfer Enable */
#define TC_PTSR_TXTEN (0x1u << 8) /**< \brief (TC_PTSR) Transmitter Transfer Enable */
#define TC_PTSR_RXCBEN (0x1u << 16) /**< \brief (TC_PTSR) Receiver Circular Buffer Enable */
#define TC_PTSR_TXCBEN (0x1u << 18) /**< \brief (TC_PTSR) Transmitter Circular Buffer Enable */
#define TC_PTSR_ERR (0x1u << 24) /**< \brief (TC_PTSR) Transfer Bus Error */
/* -------- TC_PWPMR : (TC Offset: 0x128) Write Protection Mode Register -------- */
#define TC_PWPMR_WPPTREN (0x1u << 0) /**< \brief (TC_PWPMR) Write Protection Pointer Registers Enable */
#define TC_PWPMR_WPCTREN (0x1u << 1) /**< \brief (TC_PWPMR) Write Protection Counter Registers Enable */
#define TC_PWPMR_WPCREN (0x1u << 2) /**< \brief (TC_PWPMR) Write Protection Control Register Enable */
#define TC_PWPMR_WPKEY_Pos 8
#define TC_PWPMR_WPKEY_Msk (0xffffffu << TC_PWPMR_WPKEY_Pos) /**< \brief (TC_PWPMR) Write Protection Key */
#define TC_PWPMR_WPKEY(value) ((TC_PWPMR_WPKEY_Msk & ((value) << TC_PWPMR_WPKEY_Pos)))
#define   TC_PWPMR_WPKEY_PASSWD (0x504443u << 8) /**< \brief (TC_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. */

/*@}*/


#endif /* _PIC32CX_TC_COMPONENT_ */
